/* Исходные числовые данные выбираются произвольно.
 * Вычислить сумму положительных и количество 
 * отрицательных элементов многомерного вектора v[5][5].
 */
#include <iostream>
#include "mymatrix.hpp"


int main(int, char**) {
        int V[ ][3]={1,2,3,
                   4,5,6,
                   7,8,9};
    
    



    std::cout << "Hello, world!\n";
}
