/* Исходные числовые данные выбираются произвольно.
 * Вычислить сумму положительных и количество 
 * отрицательных элементов многомерного вектора v[5][5].
 */
#include <iostream>
#include "mymatrix.hpp"


int main(int, char**) {
myMatrix<double> matrix ; 

    
    



    std::cout << "Hello, world!\n";
}
